<a href="https://colab.research.google.com/github/peterlulu666/Data-Analytics-Using-Python/blob/main/Data_Analytics_Using_Python_Week_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Reading data in JSON format

JSON (Javascript Object Notation) is now a widely used data format in web applications. Almost all of the current APIs transfer data using JSON format. It is a flexible data format in comparison to the tabular data formats like CSVs.

## Basic read operation of JSON files

Pandas has the function read_json() to read JSON formatted data. In its simplest form, you need to specify the location of the JSON data file, and it will be read into a DataFrame.

Consider the below sample file having a JSON data format. Make sure you have the file sample_data.json downloaded on your machine:

You may realise that this data representation is very similar to Python’s dictionary notation. In this particular case, the default behaviour would be to consider:

- the subkeys (0,1,2, etc) as the row labels.
- the top-level keys (Product and Price) as the column labels.

The code snippet demonstrates this behaviour: 

Code:

In [ ]:
!wget https://github.com/peterlulu666/Data-Analytics-Using-Python/raw/main/dataset.zip
!unzip dataset.zip
%cd dataset/

--2021-05-12 04:59:34--  https://github.com/peterlulu666/Data-Analytics-Using-Python/raw/main/dataset.zip
Resolving github.com (github.com)... 192.30.255.113
Connecting to github.com (github.com)|192.30.255.113|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/peterlulu666/Data-Analytics-Using-Python/main/dataset.zip [following]
--2021-05-12 04:59:34--  https://raw.githubusercontent.com/peterlulu666/Data-Analytics-Using-Python/main/dataset.zip
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 14938326 (14M) [application/zip]
Saving to: ‘dataset.zip’

dataset.zip         100%[===================>]  14.25M  48.0MB/s    in 0.3s

2021-05-12 04:59:35 (48.0 MB/s) - ‘dataset.zip’ saved [14938326/14938326]

Archive:  dataset.zip
  inflating: dataset/file_json_split.json
  inflating: dataset/file_csv_1.csv
  inflating: dataset/file_json_1.json
  inflating: dataset/sample_data_split.json
  inflating: dataset/sample_data_index.json
  inflating: dataset/sample_data1.json
  inflating: dataset/sample_data.json
  inflating: dataset/sample_data_json.txt
  inflating: dataset/sample_data_missingvalues.txt
  inflating: dataset/sample_data_footer.txt
  inflating: dataset/sample_data_comments.txt
  inflating: dataset/sample_data_noheader_space.txt
  inflating: dataset/sample_data_hierarchy.txt
  inflating: dataset/sample_data_noheader.txt
  inflating: dataset/sample_data.txt
  inflating: dataset/sample_data_large.csv
/content/dataset/dataset/dataset/dataset

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
filename = "/content/dataset/sample_data.json"
df= pd.read_json(filename)
df

         Product  Price
0         Laptop   1500
1        Desktop   1000
2         Tablet    700
3         iPhone   1800
4  Android Phone   1200

Depending on how the data is formatted in JSON, it would have an impact on how the DataFrame is created. By default:

- top-level key is considered the Column Name (0,1,2, etc)
- key at nested level 1 is considered the Row Label (Price, Product).
Consider the following JSON formatted file. Make sure you have the file sample_data_index.json downloaded on your machine:

As highlighted, this time ‘0,1,2’ will be the column labels and ‘Price and Product’ will become the row labels.

The code snippet demonstrates this.

Code:

In [ ]:
filename = "/content/dataset/sample_data_index.json"
df= pd.read_json(filename)
df

              0        1       2       3        4
Product  Laptop  Desktop  Tablet  iPhone  Android
Price      1500     1000     700    1800     1200

## Data orientation in JSON files

Data orientation behaviour can be controlled using the parameter orient. This parameter has following possible values:

- ‘split’ – dict like {index -> [index], columns -> [columns], data -> [values]}
- ‘records’ – list like [{column -> value}, … , {column -> value}]
- ‘index’ – dict like {index -> {column -> value}}
- ‘columns’ – dict like {column -> {index -> value}}
- ‘values’ – only the values array

As you can infer from the examples, the default expected orientation is Columns Orientation.

### Index formatted JSON data

In the example, the JSON data is formatted in the index format (ie {row#:{Column: Value}} format) so if we specify the orient=index, we will get the DataFrame in the desired format.

Consider the following JSON formatted file we had used previously.The code snippet demonstrates the orient=index specification. 

Code:

In [ ]:
df= pd.read_json(filename, orient='index')
df

   Product  Price
0   Laptop   1500
1  Desktop   1000
2   Tablet    700
3   iPhone   1800
4  Android   1200

### Split formatted JSON data

Consider the following JSON formatted file. Make sure you have the file sample_data_split.json downloaded on your machine:You will use the orient=split specification to create the DataFrame properly. The code snippet demonstrates.

Code:

In [ ]:
filename = "/content/dataset/sample_data_split.json"
df= pd.read_json(filename, orient='split')
df

   Product  Price
0   Laptop   1500
1  Desktop   1000
2   Tablet    700
3   iPhone   1800
4  Android   1200

Numerous variations and customisations may be needed while using the read_json function, depending on the structure of the data in the JSON formatted file. In this section, we have only covered the basics, and for detailed reference of input / output related JSON, please refer to the following link: Go to: [Pandas 0.23.4 documentation](https://pandas.pydata.org/pandas-docs/version/0.23.4/io.html#json) [1]

# Reading HTML and XML data: Web scraping

At many times, when websites don’t provide downloadable, machine-readable data formats like JSON, XML, and so on, the data might be represented as HTML formatted tables.

If this happens, you may need a way to read the HTML tables directly. Pandas have a top-level read_html() function that can accept an HTML string / file / URL and will parse the HTML table into the list of the Pandas DataFrame.

## Basic read of HTML files / URLs

The read_html() function can be used to read HTML formatted data. Let’s understand this behaviour using an example list from the Federal Deposit Insurance Corporation (FDIC) in the USA. The FDIC is often appointed as a receiver for failed banks and the list we’re using includes information on banks that have failed since 1 October 2000.

Go to: [FDIC Failed Bank List](https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/banklist.html) [1]

The code snippet demonstrates using the read_html() function;.

Code:

In [ ]:
url='https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs = pd.read_html(url)
dfs

[                         Bank NameBank  ... FundFund
 0                    Almena State Bank  ...    10538
 1           First City Bank of Florida  ...    10537
 2                 The First State Bank  ...    10536
 3                   Ericson State Bank  ...    10535
 4     City National Bank of New Jersey  ...    10534
 ..                                 ...  ...      ...
 558                 Superior Bank, FSB  ...     6004
 559                Malta National Bank  ...     4648
 560    First Alliance Bank & Trust Co.  ...     4647
 561  National State Bank of Metropolis  ...     4646
 562                   Bank of Honolulu  ...     4645

 [563 rows x 7 columns]]

Based on these results, the following can be observed:

- this call has extracted all the 561 data records from the HTML table on the web pages
- the output data is in the List Format, and not the DataFrame. This way, if there are multiple HTML tables on the webpage, we would get the list of various data frames.

Next, let’s check the type of variable dfs – this should be a list. If we access the first element of the list, this should return a DataFrame.

The code snippet highlights this behaviour.

Code:

In [ ]:
type(dfs)

list

In [ ]:
df=dfs[0]
df.head()

                      Bank NameBank  ... FundFund
0                 Almena State Bank  ...    10538
1        First City Bank of Florida  ...    10537
2              The First State Bank  ...    10536
3                Ericson State Bank  ...    10535
4  City National Bank of New Jersey  ...    10534

[5 rows x 7 columns]

Next, try inputting the code shown below and check what could be the possible return? 

Code:

In [ ]:
df.describe(include="all")

       Bank NameBank CityCity  ... Closing DateClosing      FundFund
count            563      563  ...                 563    563.000000
unique           546      433  ...                 258           NaN
top     Horizon Bank  Chicago  ...    October 30, 2009           NaN
freq               3       20  ...                   9           NaN
mean             NaN      NaN  ...                 NaN  10036.875666
std              NaN      NaN  ...                 NaN   1115.338358
min              NaN      NaN  ...                 NaN   4645.000000
25%              NaN      NaN  ...                 NaN  10116.500000
50%              NaN      NaN  ...                 NaN  10257.000000
75%              NaN      NaN  ...                 NaN  10397.500000
max              NaN      NaN  ...                 NaN  10538.000000

[11 rows x 7 columns]

We have seen in read_csv and read_json functions that there are numerous configuration parameters that control how the data is read, and the same is true with the read_html() function as well. We will explore some of the standard specifications next:

- specifying the row index
- specifying the header value
- specifying the number of rows to be skipped

## Specifying the row index

This can be done by using the index_col parameter and specifying the column name or index of the columns as the row label. In the example, we will use the first column as the row index, and we will pass the value 0 to this parameter. The code snippet demonstrates using the index_col parameter.

Code:

In [ ]:
url='https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs = pd.read_html(url,index_col=0)
df=dfs[0] #first element of list is a dataframe
df

                                            CityCity  ... FundFund
Bank NameBank                                         ...
Almena State Bank                             Almena  ...    10538
First City Bank of Florida         Fort Walton Beach  ...    10537
The First State Bank                   Barboursville  ...    10536
Ericson State Bank                           Ericson  ...    10535
City National Bank of New Jersey              Newark  ...    10534
...                                              ...  ...      ...
Superior Bank, FSB                          Hinsdale  ...     6004
Malta National Bank                            Malta  ...     4648
First Alliance Bank & Trust Co.           Manchester  ...     4647
National State Bank of Metropolis         Metropolis  ...     4646
Bank of Honolulu                            Honolulu  ...     4645

[563 rows x 6 columns]

The code snippet shows how we can access the records using the row label (bank names). 

Code:

In [ ]:
df.loc['The First State Bank']

                           CityCity StateSt  ...  Closing DateClosing FundFund
Bank NameBank                                ...
The First State Bank  Barboursville      WV  ...        April 3, 2020    10536
The First State Bank    Stockbridge      GA  ...     January 20, 2012    10419
The First State Bank        Camargo      OK  ...     January 28, 2011    10335

[3 rows x 6 columns]

In [ ]:
url='https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/'
dfs = pd.read_html(url,skiprows=10)
df=dfs[0] #first element of list is a dataframe
df

       The Farmers and Merchants State Bank of Argonia  ...  10529
0                                  Fayette County Bank  ...  10528
1    Guaranty Bank, (d/b/a BestBank in Georgia & Mi...  ...  10527
2                                       First NBC Bank  ...  10526
3                                        Proficio Bank  ...  10525
4                        Seaway Bank and Trust Company  ...  10524
..                                                 ...  ...    ...
548                                 Superior Bank, FSB  ...   6004
549                                Malta National Bank  ...   4648
550                    First Alliance Bank & Trust Co.  ...   4647
551                  National State Bank of Metropolis  ...   4646
552                                   Bank of Honolulu  ...   4645

[553 rows x 7 columns]

# Reading SQL data from database servers

In real-life applications, most of the time data is stored in the SQL-based relational databases such as MySQL, SQL Server, PostgreSQL, and so on, and various non-SQL databases like NoSQL, MongoDB, and so on.

The database in use is dependent on various architectural factors, and Python provides the mechanisms to read the data from the databases directly. This loading of data from SQL to Pandas is relatively straightforward once the connection to the database is established because both the SQL tables and DataFrame have similar constructs; that is, row labels and column labels.

In the next course, we go into the details of database designs, data definition, and data manipulation language, as well as SQL operations, to read the databases and perform various analytics activities.

For this section, we will leverage an in-memory SQLite database using Python’s built-in SQLite3 server. The focus of this session will be to read the data from the existing tables only. Run the following code by creating a dummy database and data in it. 

Code:

In [ ]:
import sqlite3

query="""
CREATE TABLE PERSON(
FirstName VARCHAR(20),
LastName VARCHAR(20),
Age INTEGER,
City VARCHAR(20),
Country VARCHAR(20)
);
"""
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

data = [('John', 'Adams', 34, 'New York', 'USA'),
('John', 'Mathews', 34, 'Berlin', 'Germany'),
('John', 'Abraham', 44, 'Paris', 'France'),
('Manoj', 'Sharma', 31, 'Delhi', 'India'),
('Pramod', 'Saini', 34, 'New York', 'USA'),
('Mark', 'Rolton', 42, 'Brisbane', 'Australia')]

stmt = "INSERT into Person VALUES(?,?,?,?,?)"
con.executemany(stmt, data)
con.commit()

## Reading data from SQL database

We have created a table named Person in SQLite3, an in-memory database available with Python 3. We will explore how to access the data from this database table.

In general, execute the following steps when you want to connect and access a database from any database via any programming language:

- Create a connection object with the database, also known as a connection string.
- Draft the SQL Query execution on that connection.
- Using the Execute Method provided by that Programming Language, run the query over the connection created.

For Python, we have a read_sql() method provided by Pandas in the pandas.io.sql module. We will leverage that to read the data from the database table Person.

See the code snippet below where we perform the above three activities, and read the data from the table named Person. 

Code:

In [ ]:
import pandas.io.sql as sql
# Next, Create Connection Object or use Previously created connection object
con = sqlite3.connect(':memory:')
# then, create a query that needs to be executed
query = 'SELECT * from PERSON'
# lastly, execute the Query using read_sql function, and passing the query and connection objects
df = pd.read_sql(query, con)
df

# Writing data to files (CSV, JSON)

So far, we have used various functions to read the data from files into Pandas DataFrame. There may be scenarios where we may have to write the data back into files. Pandas provide the functions to write the data back into files. In this section, we will look at the following two functions:

- to_csv() -> this method can create a CSV file based on the data in the DataFrame.
- to_json() -> this method can create a JSON file based on the data in the DataFrame.

## Writing a CSV file

The code snippet shows where we will create a CSV file using the function read_csv() function on a DataFrame.

Code:

In [ ]:
df

In [ ]:
filename = "/content/dataset/file_csv_1.csv"
df.to_csv(filename)

We can see that the file has been created at the specified location; that is, ‘dataset/.. ‘ in the screenshot below. You can choose to save the folder in your machine in any order, depending on where your current notebook is saved.

## Writing a JSON file

The code snippet shows where we will create a JSON file using the to_json() function on a DataFrame. Make sure your machine already has the file named file_json_1 downloaded and saved to the module 4 directory.

Code:

In [ ]:
filename = "/content/dataset/file_json_1.json"
df.to_json(filename)

Observe that the default data orientation of ‘Column’ is used to create the JSON file. You can control the data orientation in the to_json() function by passing an orient parameter.

The code snippet shows where we will pass the orient= ‘split ‘ parameter, and you can see the resulting JSON file has a different data orientation now

Code:

In [ ]:
filename = "/content/dataset/file_json_split.json"
df.to_json(filename, orient='split')

# Course assessment

1. Which of the following classes needs to be imported from the datetime module so that you can print today’s date and time?
  - tzinfo
  - date
  - timedelta
  - **datetime**

2. Which of the following methods will you use to change or manipulate the values in a particular row or a column by creating new variables?
  - **apply()**
  - sort()
  - reshape()
  - arrange()

3. After importing pandas as pd and numpy as np, which module and class should you be calling to display a dataframe?
  - **from pandas import Series, DataFrame**
  - from numpy import Series, DataFrame
  - from pandas import Series
  - from numpy import DataFrame

4. Which of the following commands will you be using to slice and present the first three values?
  - data[0,3]
  - **data[0,2]**
  - data[a,d]
  - data[a,e]
  - data[2,0]

5. In the Datetime module, which of the following classes is an abstract class to deal with timezones?
  - **tzinfo**
  - date
  - timedelta
  - datetime

6. Which of the following best describes a package in Python?
  - A package is a file containing classes and functions.
  - A package is a file of Python codes.
  - **A package is a folder of Python modules.**
  - A package is imported from a class.

7. Which one is NOT exclusively a NumPy functionality?
  - A n-dimensional Array object of homogenous data types and methods.
  - A multi-dimensional Array and matrix data structures.
  - Standard mathematical functions for faster operations on the entire Array of data without the need for loops.
  - **Useful and easy to load and preview your data.**

8. Choose the method in Numpy that will perform the cumulative sum of the elements along the axis specified as the parameter.
  - .mean()
  - **.cumsum()**
  - .sum()
  - .cum()
  - .cumulative()

9. The function used to read JSON files when loading your data is:
  - pd.read-json()
  - **pd.read_json()**
  - pd.read_jsn()
  - pdread_json()

10. Which module would you import in Pandas to load SQL data?
  - pd.iol.sql
  - pd.i.sql
  - pandas.ios.sql
  - **pandas.io.sql**